[
    {
        "title": "Python development kit",
        "preview": "I used the python dev kit to generate a basic python program, but it does not include a text editor. I want to use the code editor from the python ide. How can I do this?"
    },
    {
        "title": "Data Science",
        "preview": "Data Science is a branch of computer science that focuses on the use of data as a part of a solution to a problem. Data science is the process of using data for problem solving, and includes the study of data, tools for data analysis, the design of algorithms for data processing, and the application of these techniques. The tools and techniques used in data science can be applied to any type of problem, including the analysis of social or economic data."
    },
    {
        "title": "Last revoke",
        "preview": "An example of a policy that a user may revoke a revocation, or last revoke, is when they revoke the ability of a user to revoke another user's access.  In this scenario, the user who revokes a revoke cannot revoke that revoke themselves."
    },
    {
        "title": "Up in smoke",
        "preview": "Up in smoke: the role of tobacco in the development of chronic obstructive pulmonary disease."
    },
    {
        "title": "Huge boobs",
        "preview": "Big boobs are a huge part of my life and I am very proud of them. I have always been very conscious of what I was wearing and how I looked, to avoid being judged as a big boobed woman, but having a large breast size has always been a dream for me. That is why I decided to start a blog about my huge boobs."
    },
    {
        "title": "Oracle MySQL",
        "preview": "Oracle has released MySQL 5.6, a new major release of MySQL. This release includes a number of bug fixes and improvements, including: Support for MySQL Cluster 5.7"
    },
    {
        "title": "JavaScript object notation",
        "preview": "JavaScript object notation is a programming language feature introduced in JavaScript version 1.3, which allows a programmer to define objects. Objects are defined as a collection of properties and methods. Properties are variables that can be accessed by dot notation, while methods are functions that are invoked by the dot notation."
    },
    {
        "title": "Django framework",
        "preview": "In the past few days, I have been working on a Django project with a friend of mine. The idea was to build a small mobile application with Django, using the Django framework. It was a great experience. My friend is a mobile developer as well, and so he has a lot of experience with programming. This experience allowed us to work together very well. We did all the coding in the same computer, sharing files, comments, etc. The experience was great, but it was not for everyone."
    }
]